CainVelasquez/Cubesat-Control/Materiais/Códigos/MPLab/Programs dsPIC/AN957_dsPIC33FJ32MC204_MCLV/Init (Cópia em conflito de Felipe Faria 2015-08-26).c
//---------------------------------------------------------------------
//
//							 Software License Agreement
//
// The software supplied herewith by Microchip Technology Incorporated 
// (the “Company”) for its PICmicro® Microcontroller is intended and 
// supplied to you, the Company’s customer, for use solely and 
// exclusively on Microchip PICmicro Microcontroller products. The 
// software is owned by the Company and/or its supplier, and is 
// protected under applicable copyright laws. All rights are reserved. 
//  Any use in violation of the foregoing restrictions may subject the 
// user to criminal sanctions under applicable laws, as well as to 
// civil liability for the breach of the terms and conditions of this 
// license.
//
// THIS SOFTWARE IS PROVIDED IN AN “AS IS” CONDITION. NO WARRANTIES, 
// WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED 
// TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A 
// PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT, 
// IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR 
// CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
//
//---------------------------------------------------------------------
//	File:		Init.c
//
//						
// 
// The following files should be included in the MPLAB project:
//
//		SensoredBLDC.c		-- Main source code file
//		Interrupts.c
//		Init.c
//		SensoredBLDC.h		-- Header file
//		p33FJ32MC204.gld	-- Linker script file
//				
//
//--------------------------------------------------------------------

#include "p33EP32MC202.h"
#include "SensoredBLDC.h"


/*******************************************************************
		Inicaliza o dsPIc para operar em 60MIPS.
 * 
 * 
 * 
 * 									
*********************************************************************/
void InitPLL(void)
{
	// Configure PLL prescaler, PLL postscaler, PLL divisor
        PLLFBD=46; // M=48
        CLKDIVbits.PLLPOST=0; // N2=2
        CLKDIVbits.PLLPRE=0; // N1=2
        // Initiate Clock Switch to Primary Oscillator with PLL (NOSC=0b011)
        __builtin_write_OSCCONH(0x03);
        __builtin_write_OSCCONL(OSCCON | 0x01);
        // Wait for Clock switch to occur
        while (OSCCONbits.COSC!= 0b011);
        //  Wait for PLL to lock
        while (OSCCONbits.LOCK!= 1);


        //TRISB=0b0000000000000000;		 	  	 //Configura o PORTB;
	//TRISA=0b0000000000000000;		 	  	 //Configura o PORTA;
}



/*******************************************************************
		Below is the code required to setup the ADC registers for :
		1. 1 channel conversion (in this case AN8)
		2. PWM trigger starts conversion
		3. Pot is connected to CH0 and AN8
		4. Manual Stop Sampling and start converting
		5. Manual check of Conversion complete 
																
*********************************************************************/
void InitADC10(void)
{
	//AD1PCFGL = 0xFFFF;
 	//AD1PCFGLbits.PCFG8 = 0;         // ensure AN8 pot

 	/* set channel scanning here, auto sampling and convert,
 	   with default read-format mode */
	AD1CON1 = 0x006C;
	/* select 10-bit, 1 channel ADC operation */
	AD1CON1bits.AD12B = 0;

	/* No channel scan for CH0+, Use MUX A,
	   SMPI = 1 per interrupt, Vref = AVdd/AVss */
	AD1CON2 = 0x0000;

	/* Set Samples and bit conversion time */
	AD1CON3 = 0x032F;

	AD1CSSL = 0x0000;
        /*Skips OAX/ANX for input scan
         * Skips ANx for input scan
         */

	/* channel select AN0 */
	AD1CHS0 = 0x0000;

	IFS0bits.AD1IF = 0;
	IEC0bits.AD1IE = 1;
	AD1CON1bits.ADON = 1;
}

/********************************************************************
InitMCPWM, intializes the PWM as follows:
1. FPWM = 39000 hz
2. Independant PWMs
3. Control outputs using OVDCON
4. Set Duty Cycle with the ADC value read from pot
5. Set ADC to be triggered by PWM special trigger
*********************************************************************/

void InitMCPWM(void)
{
	PTPER = FCY/FPWM - 1;

	PWMCON1 = 0x0700;			// disable PWMs
	//OVDCON = 0x0000;			// allow control using OVD
	PDC1 = 100;					// init PWM 1, 2 and 3 to 100
	PDC2 = 100;
	PDC3 = 100;
	SEVTCMP = PTPER;
	PWMCON2 = 0x0F00;			// 16 postscale values
	//PTCON = 0x8000;				// start PWM
	 
}
/*********************************************************************
  Function:        void InitICandCN(void)

  Overview:        Configure Hall sensor inputs, one change notification and 
                   two input captures. on IC7 the actual capture value is used
                   for further period calculation

  Note:            None.
********************************************************************/

void InitIC(void)
{
	/*Função para iniciar os imput captures para os sensores hall do motor
        *
        *RPI32 - RB0 - IC1 --> Hall 1
        *RPI33 - RB1 - IC2 --> Hall 2
        *RP39 - RB7 - IC3  --> Hall 3*/

	TRISBbits.TRISB0= 1;	// Ensure that hall connections are inputs
        TRISBbits.TRISB1= 1;
        TRISBbits.TRISB7= 1;
	
	IC1CON1 = 1;			// Init all 3 Hall Effect capture inputs:
	IC2CON1 = 1;			// Timer 3, every capture event, rise & fall edges
	IC3CON1 = 1;
	
	IFS0bits.IC1IF = 0;	// Clear interrupt flag
	IFS0bits.IC2IF = 0;
	IFS2bits.IC3IF = 0;

	IEC0bits.IC1IE = 1;	// Enable interrupt
	IEC0bits.IC2IE = 1;
	IEC2bits.IC3IE = 1;
}

/************************************************************************
Tmr3 is used to determine the rotor speed so it is set to count using Tcy/256

*************************************************************************/

void InitTMR3(void)
{
	T3CON = 0x0030;			// internal Tcy/256 clock
	TMR3 = 0;
	PR3 = 0xFFFF;
}

/************************************************************************
Initialize the UART2 for BAUD = 9600, no parity, 1 stop

*************************************************************************/

void InitTMR1(void)
{
	// MIPs / (Scale * Hz interrupt)
	// For this design, 8MHz * 2.5PLL, = 10 MIP
	// 10MIP/(64 * 1000) = 156, => PR1 = 156 for 1000Hz interrupt
	
	T1CON = 0x8020;			// internal Tcy/64 clock
	TMR1 = 0;
	PR1 = T1PR1;		
	T1CONbits.TON = 1;		// turn on timer 1 
	IFS0bits.T1IF = 0;
	IEC0bits.T1IE = 1;
	return;
}
/*
 *Função para configuração do Status LED
 *Pino RA1 - OutPut
 */
void InitStatusLED(void)
{
    TRISAbits.TRISA1 = 0;
}
/*
 *Função para configurar 5 portas para outputs
 * para controle do driver de acinamento do motor
 *
 *OBS:não pode ser configurada junto com o CAN!
 *
 *RB15 - EN1 - PWM1 --> Fase 1 Motor
 *RB13 - EN2 - PWM2 --> Fase 2 Motor
 *RB11 - EN3 - PWM3 --> Fase 3 Motor
 *RA4  - RESET8313N --> Reset do driver motor
 *RB5  - SLEEP8313N --> SLEEP do driver motor
 *
 */
void InitOUT_5(void)
{
    TRISBbits.TRISB15 = 0;
    TRISBbits.TRISB13 = 0;
    TRISBbits.TRISB11 = 0;
    TRISAbits.TRISA4 = 0;
    TRISBbits.TRISB5 = 0;

}
